{"pages":[{"title":"about","text":"A random fucker. Oh, there you are. This is a static blog by a random fucker from UESTC, who loves play with computer-related gadgets. but lazy to work. He join a mysterious club with an abbr. of CNSS, where many gay who loves cyber security gather together, so he may share some post about it. That’s for now! Bye-ya!","link":"/about/index.html"},{"title":"friends","text":"You can find some gei’s fun blog here!yypE’s Playground","link":"/friends/index.html"}],"posts":[{"title":"gdb-peda & pwndbg commonly used commands","text":"Breakpointsb / break *addr or b func bp at addr or bp at func tb one-time-only breakpoint info b view all breakpoints watch *addr stop when mem at addr changed. Control &amp; debuggingc continue r run ni step over si step in fini run till func ret return expr assign return value of expr s / stack show stack and registers and disasm bt current stack frame ​ Example 1234#0 0xf7e250d0 in gets () from /usr/lib32/libc.so.6#1 0x080486b3 in main () at ret2text.c:24#2 0xf7dd6b41 in __libc_start_main () from /usr/lib32/libc.so.6#3 0x08048521 in _start () Memorybins show bins vmmap show virtual memory map shellcode generate shellcode context show context contents","link":"/2018/10/04/gdb-peda & pwndbg commonly used commands/"},{"title":"Arch Linux on WSL","text":"Arch Linux on WSL要经常在 Linux 和 -辣鸡- Windows 之间来回折腾真的是很难受，而且有时候还只是要在 Shell 上跑点脚本或者命令。 所幸有 WSL 这个好东西，但是 Micro soft Store 能下载的只有 Ubuntu。 学习了一下可以用一些特殊的技巧变成 Arch ，再在AUR 上下东西就方便得多的了。 1. 先在 Store 里下载 Ubuntu，并且在 Powershell 下把默认用户改成 root ubuntu —-config user root 2. 从 USTC 或者清华的镜像站下载 archlinux-bootstrap， 为了方便建议放在任意盘符的根目录下。 1. Ubuntu 下 `cd /mnt/c` 并 `tar -zxvf`（不要在 Windows 下解压，否则会导致权限问题） 2. 在 Windows Explorer 中将 Ubuntu 目录下的 LocalState/rootfs/中的以下文件删除。并且用 archlinux-bootstrap 中的同名文件和目录替换。 * bin * etc * lib * lib64 * sbin * usr * var 从运行 Arch 的电脑或者软件源下载 fakeroot-tcp 并且放在文件系统中一个方便的目录下 （如果你想使用AUR ，这一步是必要的） 再次进入 Ubuntu 并运行 pacman-key —init pacman-key —populate archlinux pacman -U path-to-fakeroot-tcp pacman -Syyu base base-devel 新建一个用户并且添加到 sudoers 开始欢乐","link":"/2018/10/10/Arch-Linux-on-WSL/"}],"tags":[{"name":"pwn","slug":"pwn","link":"/tags/pwn/"},{"name":"gdb","slug":"gdb","link":"/tags/gdb/"},{"name":"linux","slug":"linux","link":"/tags/linux/"}],"categories":[]}